app/views/users/index.html.erb

    <input type="button" class="addFriend" name="addFriend" value="Add as a Friend" id="add_friend" data-victim-id="<%= user.id %>">
    <% found_friendship = Friendship.find_by_stalker_id_and_victim_id(current_user.id, user.id) %>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."stalker_id" = 2 AND "friendships"."victim_id" = 1 LIMIT 1