app/controllers/friendships_controller.rb

  def create
    @friendship = Friendship.new(params[:friendship])
    @friendship.stalker_id = current_user.id

    if @friendship.save!
---
INSERT INTO "friendships" ("created_at", "stalker_id", "updated_at", "victim_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 26 Sep 2013 14:49:28 UTC +00:00], ["stalker_id", 2], ["updated_at", Thu, 26 Sep 2013 14:49:28 UTC +00:00], ["victim_id", 1]]

  def destroy
    @friendship = Friendship.find_by_id(params[:id])

    if @friendship
      @friendship.delete
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 9 LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."id" = 9