app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @secret = Secret.new
    @recipient_id = params[:id]
    if params.include?(:id)
      @user = User.find(params[:id])